In [1]:
import pandas as pd

In [2]:
ct = pd.read_csv('Data/Contactos.csv')

In [3]:
ct

  Firth name  Last name Working
0    Eduardo       Lowe     yes
1     George     Benson     yes
2     Olivia     Fuller     yes
3       Noah   Mccarthy     yes
4     Oliver     Bowman      no
5    William      Marsh      no
6     Abdiel  Rodriguez      no

In [4]:
ct.columns

Index(['Firth name', 'Last name', 'Working'], dtype='object')

In [5]:
ct.columns = ['nombre_', 'apellido_', 'trabaja_'] #se le cambio el nombre a las colunmas

In [6]:
ct.columns

Index(['nombre_', 'apellido_', 'trabaja_'], dtype='object')

In [7]:
ct.columns = [x.title() for x in ct.columns] #Metodo para colocar los metodos de string a todas las columnas as title(),upper(),lower()
ct

   Nombre_  Apellido_ Trabaja_
0  Eduardo       Lowe      yes
1   George     Benson      yes
2   Olivia     Fuller      yes
3     Noah   Mccarthy      yes
4   Oliver     Bowman       no
5  William      Marsh       no
6   Abdiel  Rodriguez       no

In [8]:
ct.columns = ct.columns.str.replace('_', ' ') #Metodo oara reemplazar cualquie condicion o letra str
ct

   Nombre   Apellido  Trabaja
0  Eduardo       Lowe      yes
1   George     Benson      yes
2   Olivia     Fuller      yes
3     Noah   Mccarthy      yes
4   Oliver     Bowman       no
5  William      Marsh       no
6   Abdiel  Rodriguez       no

In [9]:
ct.rename(columns={'Nombre': 'Nombre_1'}, inplace=True) # Tambien se puede cambiar como el metodo de reemplaso de diccionario

In [10]:
ct.loc[2] = ['Lincoln','Brad', 'no'] # Metodo para replazar los valores de una fila determinada

In [11]:
ct

   Nombre   Apellido  Trabaja
0  Eduardo       Lowe      yes
1   George     Benson      yes
2  Lincoln       Brad       no
3     Noah   Mccarthy      yes
4   Oliver     Bowman       no
5  William      Marsh       no
6   Abdiel  Rodriguez       no